import "./App.css";
import travel_01 from "./assets/travel-01.jpg";
import travel_02 from "./assets/travel-02.jpg";
import travel_03 from "./assets/travel-03.jpg";
import Hero from "./components/Hero";
import Navbar from "./components/Navbar";
import Slider from "./components/Slider";

function App() {
  const navbarLinks = [
    { url: "#", title: "Придбати" },
    { url: "#", title: "Інфо" },
    { url: "#", title: "Про нас" },
  ];

  return (
    <div className="App">
      <Navbar navbarLinks={navbarLinks} />
      <Hero imageSrc={travel_01} />
      <Slider
        imageSrc={travel_02}
        title={"Чому саме Mix Protein Slim?"}
        subtitle={
          "Шукаєте ефективний спосіб досягти своїх цілей по зниженню ваги? Зверніть увагу на Mix Protein Slim від Choice Company! Наша унікальна суміш протеїнових порошків, включаючи сироватковий та рослинний, розроблена, щоб допомогти вам наростити сухі м'язи та спалити жир, одночасно втамувавши голод і підтримуючи відчуття ситості. Крім того, завдяки чудовому смаку та легкій у змішуванні формулі, Mix Protein Slim є ідеальним доповненням до вашого здорового способу життя. Тож навіщо чекати? Розпочніть свій шлях до стрункості та здоров'я разом з Mix Protein Slim від Choice Company!"
        }
      />
      <Slider
        imageSrc={travel_03}
        title={"Ось кілька переваг Mix Protein Slim від компанії Choice:"}
        subtitle={" 1) Підтримує втрату ваги: Mix Protein Slim спеціально розроблений, щоб допомогти вам схуднути, сприяючи зростанню сухої м'язової маси та зменшенню жирових відкладень. 2) Задовольняє відчуття голоду: Білок, що входить до складу Mix Protein Slim, допомагає вам почуватися ситими та задоволеними, що зменшує тягу до їжі та запобігає переїданню. 3) Формує суху м'язову масу: Унікальна суміш джерел білка в Mix Protein Slim, включаючи сироватковий і рослинний білки, забезпечує незамінними амінокислотами, необхідними для підтримки росту і збереження сухої м'язової маси. 4) Підвищує продуктивність під час тренувань: Протеїн, що міститься в Mix Protein Slim, може допомогти поліпшити результати тренувань, забезпечуючи енергією, необхідною для виконання інтенсивних вправ. 5) Зручний і простий у використанні: Mix Protein Slim випускається у зручній формі порошку, який можна змішувати з водою або улюбленим напоєм, що робить його простим у застосуванні та інтегрує у вашу щоденну рутину. 6) Чудовий смак: Mix Protein Slim випускається з різноманітними смаками, які задовольнять ваші смакові рецептори без шкоди для досягнення цілей схуднення. 7) Загалом, Mix Protein Slim - це універсальний та ефективний продукт, який може допомогти вам досягти ваших цілей у сфері схуднення та фітнесу, одночасно підтримуючи ваше здоров'я та самопочуття."}
        flipped={true}
      />
    </div>
  );
}

export default App;
